Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Now you can press <Enter> directly. You don't have to move the cursor to the end of the line before executing the command.
es_es: Ya puede pulsar <Intro> directamente. No tiene que desplazar el cursor al final de la línea antes de ejecutar la orden.

source: <Left> one character left <Right> one character right <S-Left> or <C-Left> one word left <S-Right> or <C-Right> one word right CTRL-B or <Home> to begin of command line CTRL-E or <End> to end of command line
es_es: <Izquierda> un carácter a la izquierda <Derecha> un carácter a la derecha <S-Izq.> o <C-Izq.> una palabra a la izquierda <S-Der.> o <C-Der.> una palabra a la derecha CTRL-B o <Inicio> al inicio de la línea de órdenes CTRL-E o <Fin> al final de la línea de órdenes

source: Note: <S-Left> (cursor left key with Shift key pressed) and <C-Left> (cursor left key with Control pressed) will not work on all keyboards. Same for the other Shift and Control combinations.
es_es: Nota: <S-Izq.> (tecla izquierda del cursor con la tecla Shift pulsada) y <C-Izq.> (tecla izquierda del cursor con la tecla Control pulsada) no funciona en todos los teclados. Ocurre lo mismo con las otras combinaciones con Shift y Control.

source: As mentioned, <BS> deletes the character before the cursor. To delete a whole word use CTRL-W.
es_es: Como ya se ha dicho, <BS> elimina el carácter anterior al cursor. Para eliminar toda una palabra, use CTRL-W.

source: /the fine pig ~
es_es: /el sutil cerdo ~

source: /the fine ~
es_es: /el sutil ~

source: The <Insert> key toggles between inserting characters and replacing the existing ones. Start with this text:
es_es: La tecla <Insertar> conmuta entra insertar caracteres y reemplaza los existentes. Comience con este texto.

source: Move the cursor to the start of "fine" with <S-Left> twice (or <Left> eight times, if <S-Left> doesn't work). Now press <Insert> to switch to overstrike and type "great":
es_es: Desplace el cursor al inicio de «sutil» con <S-Izq.> dos veces (o <Izq.> ocho veces, si <S-Izq.> no funciona. Pulse ahora <Insertar> para pasar a superposición y teclee «gran»:

source: /the greatpig ~
es_es: /el grancerdo ~

source: Oops, we lost the space. Now, don't use <BS>, because it would delete the "t" (this is different from Replace mode). Instead, press <Insert> to switch from overstrike to inserting, and type the space:
es_es: Vaya, hemos perdido un espacio. Ahora, no use <BS> porque eliminaría la «t» (a diferencia del modo Reemplazar). En lugar de ello, pulse <Insertar> para pasar de superposición a insertar, e introduzca el espacio:

source: /the great pig ~
es_es: /el gran cerdo ~

source: You thought of executing a : or / command, but changed your mind. To get rid of what you already typed, without executing it, press CTRL-C or <Esc>.
es_es: Se le ocurrió ejecutar una orden «:» o «/», pero cambió de opinión. Para desechar de lo que ya tecleó sin ejecutarlo pulse CTRL-C o <Esc>.

source: Note: <Esc> is the universal "get out" key. Unfortunately, in the good old Vi pressing <Esc> in a command line executed the command! Since that might be considered to be a bug, Vim uses <Esc> to cancel the command. But with the 'cpoptions' option it can be made Vi compatible. And when using a mapping (which might be written for Vi) <Esc> also works Vi compatible. Therefore, using CTRL-C is a method that always works.
es_es: Nota: <Esc> es la tecla universal de salir. Desafortunadamente, en el bueno y viejo Vi, pulsar <Esc> la línea de órdenes ejecutaba la orden. Ya que esto se puede considerar un fallo, Vim usa <Esc> para cancelar la orden. Pero puede hacer que sea compatible con Vi con la opción 'cpoptions'. Y cuando usa una macro (quizá escrito para Vi) <Esc> también funciona de manera compatible con Vi. Por ello, siempre funcionará el metodo CTRL-C.

source: If you are at the start of the command line, pressing <BS> will cancel the command. It's like deleting the ":" or "/" that the line starts with.
es_es: Si se halla al inicio de la línea de órdenes, pulsar <BS> cancelaría la orden. Es como eliminar el «:» o «/» al inicio de la línea.

source: *20.2* Command line abbreviations
es_es: *20.2* Abreviaturas en línea de órdenes

source: Some of the ":" commands are really long. We already mentioned that ":substitute" can be abbreviated to ":s". This is a generic mechanism, all ":" commands can be abbreviated.
es_es: Algunas de las órdenes «:» son muy largas. Ya hemos mencionado que «:substitute» se puede abreviar con «:s». Este es un mecanismo genérico, todas las órdenes «:» se pueden abreviar.

source: How short can a command get? There are 26 letters, and many more commands. For example, ":set" also starts with ":s", but ":s" doesn't start a ":set" command. Instead ":set" can be abbreviated to ":se". When the shorter form of a command could be used for two commands, it stands for only one of them. There is no logic behind which one, you have to learn them. In the help files the shortest form that works is mentioned. For example: >
es_es: ¿Como de corto puede ser una orden? Hay unas 30 letras, y muchas más órdenes. Por ejemplo, «:set» también empieza con «:s», pero «:s» no inicia la orden «:set». En lugar de ello, puede abreviar «:set» con «:se». Cuando se podría usar la forma corta de una orden para dos órdenes, sólo simboliza uno de ellos. No hay una lógica detrás de cada elección, tendrá que aprenderlos. En los archivos de ayuda se menciona la forma más corta que funciona. Por ejemplo: >

source: This means that the shortest form of ":substitute" is ":s". The following characters are optional. Thus ":su" and ":sub" also work.
es_es: Esto significa que la forma corta de «:substitute» es «:s». Los siguientes caracteres son opcionales. Por ello, también funcionan «:su» y «:sub».

source: In the user manual we will either use the full name of command, or a short version that is still readable. For example, ":function" can be abbreviated to ":fu". But since most people don't understand what that stands for, we will use ":fun". (Vim doesn't have a ":funny" command, otherwise ":fun" would be confusing too.)
es_es: En el manual de usuario usaremos o bien el nombre completo de la orden, o una versión corta pero legible. Por ejemplo, se puede acortar «:function» a «:fu». Pero debido a que la mayoría de la gente no entiende qué simboliza, nosotros usaremos «:fun». (Vim no tiene una orden llamada «:funny», en caso contrario, esto también sería confuso.)

source: It is recommended that in Vim scripts you write the full command name. That makes it easier to read back when you make later changes. Except for some often used commands like ":w" (":write") and ":r" (":read"). A particularly confusing one is ":end", which could stand for ":endif", ":endwhile" or ":endfunction". Therefore, always use the full name.
es_es: Recomendamos que escriba la orden completa en los Vim scripts. Esto hace más fácil leerlo cuando introduce cambios más tarde. A excepción de órdenes usadas con frecuencia como «:w» («:write») y «:r» («:read»). Un caso particularmente confuso es «:end», que podría simbolizar «:endif», «:endwhile» o «:endfunction». Por ello, use siempre el nombre completo.

source: In the user manual the long version of the option names is used. Many options also have a short name. Unlike ":" commands, there is only one short name that works. For example, the short name of 'autoindent' is 'ai'. Thus these two commands do the same thing: >
es_es: En el manual de usuario se usa la versión larga de los nombres de opción. Varias opciones tienen también un nombre corto. A diferencia de las órdenes «:», sólo hay un nombre corto que funcione. Por ejemplo, el nombre corto de 'autoindent' es 'ai'. Por ello, estas dos órdenes hacen lo mismo: >

source: *20.3* Command line completion
es_es: *20.3* Autocompletado en la línea de órdenes

source: This is one of those Vim features that, by itself, is a reason to switch from Vi to Vim. Once you have used this, you can't do without.
es_es: Esta es una opción que en si misma hace que merezca la pena pasar de Vi a Vim. Una vez que haya usado esto, no podrá vivir sin el.

source: It's easy to type this wrong. A much quicker way is: >
es_es: Es fácil equivocarse al teclear esto. Una manera más rápida es: >

source: Which will result in the same command. What happened? The <Tab> key does completion of the word before the cursor. In this case "b". Vim looks in the directory and finds only one file that starts with a "b". That must be the one you are looking for, thus Vim completes the file name for you.
es_es: Esto viene a ser la misma orden. ¿Qué ocurrió? La tecla <Tab> realiza el autocompletado de la palabra anterior al cursor. «b» en este caso. Vim busca en el directorio y encuentra sólo un archivo cuyo nombre empieza por «b». Este debe ser el que está buscando, y por ello Vim completa por usted el nombre del archivo.

source: Now type: >
es_es: Teclee ahora: >

source: The beep means that Vim has found more than one match. It then uses the first match it found (alphabetically). If you press <Tab> again, you get: >
es_es: El pitido significa que Vim encontró más de una coincidencia. Entonces usa la primera coincidencia encontrada (en orden alfabético). Si pulsa <Tab> otra vez, obtendrá: >

source: Thus, if the first <Tab> doesn't give you the file you were looking for, press it again. If there are more matches, you will see them all, one at a time. If you press <Tab> on the last matching entry, you will go back to what you first typed: >
es_es: Por ello, si el primer <Tab> no le da el archivo que está buscando, púlselo otra vez. Si hay más coincidencias, las verá todas de una en una. Si pulsa <Tab> otra vez en la última entrada coincidente, volverá a lo que tecleo en un principio: >

source: What happens here is that Vim inserts the old value of the option. Now you can edit it. What is completed with <Tab> is what Vim expects in that place. Just try it out to see how it works. In some situations you will not get what you want. That's either because Vim doesn't know what you want, or because completion was not implemented for that situation. In that case you will get a <Tab> inserted (displayed as ^I).
es_es: Lo que aquí ocurre es que Vim inserta el valor antiguo de la opción. Puede editarla ahora. Lo que se completó con <Tab> es lo que Vim espera en primer lugar. Pruebe esto ahora para ver su funcionamiento. En algunas situaciones no obtendrá lo que desea. Esto es debido a que Vim no sabe lo que quiere, o porque no se ha implementado el autocompletado para este evento. En ese caso, obtendrá un <Tab> insertado (se mostrará como ^I).

source: When there are many matches, you would like to see an overview. Do this by pressing CTRL-D. For example, pressing CTRL-D after: >
es_es: Cuando haya coinicidencias, querrá una vista general. Obtenga esto pulsando CTRL-D. Por ejemplo, si pulsa CTRL-D después de: >

source: The CTRL-L command completes the word to the longest unambiguous string. If you type ":edit i" and there are files "info.txt" and "info_backup.txt" you will get ":edit info".
es_es: La orden CTRL-L completa la palabra hasta llegar a la cadena no ambigua más larga. Si teclea «:edit i» y hay archivos «info.txt» e «info_backup.txt» obtendrá «:edit info».

source: *20.4* Command line history
es_es: *20.4* Histórico de la línea de órdenes

source: In chapter 3 we briefly mentioned the history. The basics are that you can use the <Up> key to recall an older command line. <Down> then takes you back to newer commands.
es_es: En el capítulo 3 mencionamos de manera breve el historial. Lo básico es que puede usar la tecla <Arriba> para invocar una orden ya pasada. <Abajo> le lleva a aquellas órdenes más recientes.

source: There are actually four histories. The ones we will mention here are for ":" commands and for "/" and "?" search commands. The "/" and "?" commands share the same history, because they are both search commands. The two other histories are for expressions and input lines for the input() function. |cmdline-history|
es_es: De hecho, hay cuatro historiales. Los que vamos a mencionar aquí son las órdenes «:» y las órdenes de búsqueda «/» y «?». Las órdenes «/» y «?» comparten el mismo historial, ya que ambos son órdenes de búsqueda. Los otros dos historiales sirven para las expresiones y líneas de entrada de la función input(). |cmdline-history|

source: Suppose you have done a ":set" command, typed ten more colon commands and then want to repeat that ":set" command again. You could press ":" and then ten times <Up>. There is a quicker way: >
es_es: Suponga que ejecutó una orden «:set», introdujo diez órdenes «:» más y que después quiera repetir la orden «:set» otra vez. Puede pulsar «:» y diez veces <Arriba>. Existe una manera más rápida.

source: Vim will now go back to the previous command that started with "se". You have a good chance that this is the ":set" command you were looking for. At least you should not have to press <Up> very often (unless ":set" commands is all you have done).
es_es: Vim volverá ahora a la orden anterior que empezase con «se». Tendrá muchas posibilidades de que esta sea la oren «:set» que estaba buscando. Por lo menos no tendrá que pulsar <Arriba> varias veces (a menos que las órdenes «:set» sea todo lo que ha hecho).

source: The <Up> key will use the text typed so far and compare it with the lines in the history. Only matching lines will be used. If you do not find the line you were looking for, use <Down> to go back to what you typed and correct that. Or use CTRL-U to start all over again.
es_es: La tecla <Arriba> usará el texto introducido hasta el momento y lo comparará con las líneas en el historial. Solo se usarán las líneas coincidentes. En caso de no encontrar la línea que buscaba, use <Down> para volver a lo que tecleó y corrija eso. O use CTRL-U para iniciar el proceso otra vez.

source: That's the history of ":" commands. The search history is displayed with this command: >
es_es: Este es el historial de las órdenes «:». Puede ver el historial de búsquedas con esta orden: >

source: *20.5* Command line window
es_es: *20.5* Ventana de la línea de órdenes

source: Typing the text in the command line works different from typing text in Insert mode. It doesn't allow many commands to change the text. For most commands that's OK, but sometimes you have to type a complicated command. That's where the command line window is useful.
es_es: Teclear el texto en la línea de órdenes funciona de manera distinta a teclear texto en el modo Insertar. No permite a varias órdenes modificar el texto. Esto está bien para varias órdenes, aunque a veces tiene que teclear una orden complicada. En esta situación es cuando la ventana de línea de órdenes es útil.

source: Vim now opens a (small) window at the bottom. It contains the command line history, and an empty line at the end:
es_es: Vim abrirá ahora una pequeña ventana en la base. Contiene el historial de la línea de órdenes, y una línea vacía al final.

source: +-------------------------------------+ |other window | |~ | |file.txt=============================| |:e c | |:e config.h.in | |:set path=.,/usr/include,, | |:set iskeyword=@,48-57,_,192-255 | |:set is | |:q | |: | |command-line=========================| | | +-------------------------------------+
es_es: +-------------------------------------+ |otra ventana | |~ | |file.txt=============================| |:e c | |:e config.h.in | |:set path=.,/usr/include,, | |:set iskeyword=@,48-57,_,192-255 | |:set is | |:q | |: | |línea de órdenes=====================| | | +-------------------------------------+

source: You are now in Normal mode. You can use the "hjkl" keys to move around. For example, move up with "5k" to the ":e config.h.in" line. Type "$h" to go to the "i" of "in" and type "cwout". Now you have changed the line to:
es_es: Ahora se encuentra en el modo Normal. Puede usar las teclas «hjkl» para desplazarse. Por ejemplo, desplácese con «5k» hasta la línea «:e config.h.in». Teclee «$h» para ir a la «i» de «in» y teclee «cwout». Ahora, ha cambiado la línea a:

source: The command line window is very useful when you want to have overview of the history, lookup a similar command, change it a bit and execute it. A search command can be used to find something. In the previous example the "?config" search command could have been used to find the previous command that contains "config". It's a bit strange, because you are using a command line to search in the command line window. While typing that search command you can't open another command line window, there can be only one.
es_es: La ventana de línea de órdenes es muy útil cuando quiere una vista general del historial, mirar una orden similar, modificarlo y ejecutarlo. Puede usar una orden de búsqueda para buscar algo. En el ejemplo anterior, la orden de búsqueda «?config» se podría haber usado para encontrar una orden anterior que contenga «?config». Es un poco extraño, pues está usando una línea de órdenes para buscar en la ventana de línea de órdenes. No podrá abrir otra ventana de línea de órdenes mientras teclee la orden de búsqueda, ya que sólo puede haber una.

source: *usr_08.txt* For Vim version 7.3. Last change: 2006 Jul 18
es_es: *usr_08.esx* Para Vim versión 7.3. Último cambio: 18/6/2006

source: Splitting windows
es_es: Dividir en ventanas

source: Display two different files above each other. Or view two locations in the file at the same time. See the difference between two files by putting them side by side. All this is possible with split windows.
es_es: Mostrar dos archivos diferentes uno encima del otro. Mirar dos puntos del mismo archivo a la vez. Ver las diferencias entre un archivo y otro poniéndolos uno al lado del otro. Todo esto es posible dividiendo en ventanas.

source: |08.1| Split a window |08.2| Split a window on another file |08.3| Window size |08.4| Vertical splits |08.5| Moving windows |08.6| Commands for all windows |08.7| Viewing differences with vimdiff |08.8| Various |08.9| Tab pages
es_es: |08.1| Dividir una ventana |08.2| Dividir una ventana con otro archivo |08.3| Tamaño de ventana |08.4| Divisiones verticales |08.5| Mover ventanas |08.6| Órdenes sobre todas las ventanas |08.7| Ver las diferencias con «vimdiff» |08.8| Varios |08.9| Pestañas

source: Next chapter: |usr_09.txt| Using the GUI Previous chapter: |usr_07.txt| Editing more than one file Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_09.esx| Uso de la interfaz gráfica Capítulo anterior: |usr_07.esx| Editar más de un archivo Tabla de contenidos: |usr_toc.esx|

source: *08.1* Split a window
es_es: *08.1* Dividir una ventana

source: +----------------------------------+ |/* file one.c */ | |~ | |~ | |one.c=============================| |/* file one.c */ | |~ | |one.c=============================| | | +----------------------------------+
es_es: +----------------------------------+ |/* archivo uno.c */ | |~ | |~ | |uno.c=============================| |/* archivo uno.c */ | |~ | |uno.c=============================| | | +----------------------------------+

source: The CTRL-W w command can be used to jump between the windows. If you are in the top window, CTRL-W w jumps to the window below it. If you are in the bottom window it will jump to the first window. (CTRL-W CTRL-W does the same thing, in case you let go of the CTRL key a bit later.)
es_es: La orden CTRL-W w se puede usar para saltar de una ventana a otra. Si está en la ventana superior, CTRL-W w salta a la ventana inferior. Si está en la ventana inferior saltará a la primera ventana. (CTRL-W CTRL-W hace lo mismo, en caso de que suelte la tecla CTRL un poco después.)

source: Actually, any command that quits editing a file works, like ":quit" and "ZZ". But ":close" prevents you from accidentally exiting Vim when you close the last window.
es_es: De hecho, cualquier orden que salga del archivo funciona, como «:quit» y «ZZ». Pero «:close» evitará que salga accidentalmente de Vim cuando cierre la última ventana.

source: This closes all windows, except for the current one. If any of the other windows has changes, you will get an error message and that window won't be closed.
es_es: Esto cierra todas las ventanas, excepto la actual. Si cualquiera de las otras ventanas tiene cambios, obtendrá un mensaje de error y esa ventana no se cerrará.

source: *08.2* Split a window on another file
es_es: *08.2* Dividir una ventana con otro archivo

source: The following command opens a second window and starts editing the given file: > :split two.c
es_es: La siguiente orden abre una segunda ventana y comienza la edición de un archivo: > :split two.c

source: +----------------------------------+ |/* file two.c */ | |~ | |~ | |two.c=============================| |/* file one.c */ | |~ | |one.c=============================| | | +----------------------------------+
es_es: +----------------------------------+ |/* archivo dos.c */ | |~ | |~ | |two.c=============================| |/* archivo uno.c */ | |~ | |one.c=============================| | | +----------------------------------+

source: *08.3* Window size
es_es: *08.3* Tamaño de ventana

source: The ":split" command can take a number argument. If specified, this will be the height of the new window. For example, the following opens a new window three lines high and starts editing the file alpha.c: >
es_es: La orden «:split» puede recibir un argumento numérico. Si se especifica, este será la altura de la nueva ventana. Por ejemplo, el siguiente abre una nueva ventana con una altura de tres líneas y edita el archivo alpha.c: >

source: For existing windows you can change the size in several ways. When you have a working mouse, it is easy: Move the mouse pointer to the status line that separates two windows, and drag it up or down.
es_es: Para ventanas ya existentes puede cambiar el tamaño de varias formas. Cuando tiene un ratón, es fácil: Coloque el puntero en la línea de estado que separa las dos ventanas y arrástrela.

source: Both of these commands take a count and increase or decrease the window size by that many lines. Thus "4 CTRL-W +" make the window four lines higher.
es_es: Ambas órdenes reciben un multiplicador que modificará la altura de ventana ese número de líneas. «4 CTRL-W +» hará la ventana cuatro líneas más alta.

source: {height}CTRL-W _
es_es: {altura}CTRL-W _

source: That's: a number {height}, CTRL-W and then an underscore (the - key with Shift on English-US keyboards). To make a window as high as it can be, use the CTRL-W _ command without a count.
es_es: O sea: un número {altura}, CTRL-W y luego un guión bajo (Mayúsculas más la tecla -). Para maximizar una ventana, use la orden CTRL-W _ sin ningún multiplicador ni argumento.

source: In Vim you can do many things very quickly from the keyboard. Unfortunately, the window resizing commands require quite a bit of typing. In this case, using the mouse is faster. Position the mouse pointer on a status line. Now press the left mouse button and drag. The status line will move, thus making the window on one side higher and the other smaller.
es_es: En Vim puede hacer muchas cosas muy rápidamente desde el teclado. Por desgracia, las órdenes de ajuste de las ventanas requieren mucho trabajo. En este caso, usar el ratón es más rápido. Coloque el ratón sobre la línea de estado. Ahora presione el botón izquierdo y arrastre. La línea de estado se desplazará, ajustando el tamaño de la ventana.
